IICT _27_class 04_ Panda

In [1]:
import pandas as pd
import numpy as np

check pandas version

In [2]:
print(pd.__version__)

1.4.4

f string kmne use korte hoi

In [3]:
print(f"pandas version: {pd.__version__}")

pandas version: 1.4.4

In [8]:
demo_list=[1,2,3]
a= pd.Series(demo_list)
print(type(a))

<class 'pandas.core.series.Series'>

In [9]:
cars=pd.Series(["BMW","toyota","Honda"])
colors= pd.Series(["Red","white","Blue"])
print(cars)
print(colors)

0       BMW
1    toyota
2     Honda
dtype: object
0      Red
1    white
2     Blue
dtype: object

In [10]:
car_color=pd.DataFrame({"car type":cars, "car color":colors})
display(car_color)

  car type car color
0      BMW       Red
1   toyota     white
2    Honda      Blue

ekta dataframe toiri kora dictionnaryr madhome

In [15]:
student_data={"Name":["Sakib","Momin","kawsar","Sakiba","Mominul","kawsary"],
              "Age":[24,25,26,24,25,26],
              "Dept":["URP","ME","CE","CSE","EEE","GCE"],
              "Score":[63,80,90,63,80,90],
             "Grad. year":[2026,2025,2024,2026,2025,2024],
             "Schoolarship":[False,True,False,False,True,False]}
a=pd.DataFrame(student_data)
display(a)

      Name  Age Dept  Score  Grad. year  Schoolarship
0    Sakib   24  URP     63        2026         False
1    Momin   25   ME     80        2025          True
2   kawsar   26   CE     90        2024         False
3   Sakiba   24  CSE     63        2026         False
4  Mominul   25  EEE     80        2025          True
5  kawsary   26  GCE     90        2024         False

ei command dara kuno boro data set er prothom 5 ta row data dekha jabe

In [17]:
print(a.head())

      Name  Age Dept  Score  Grad. year  Schoolarship
0    Sakib   24  URP     63        2026         False
1    Momin   25   ME     80        2025          True
2   kawsar   26   CE     90        2024         False
3   Sakiba   24  CSE     63        2026         False
4  Mominul   25  EEE     80        2025          True

last er 5 ta row dite parbe

In [18]:
print(a.tail())

      Name  Age Dept  Score  Grad. year  Schoolarship
1    Momin   25   ME     80        2025          True
2   kawsar   26   CE     90        2024         False
3   Sakiba   24  CSE     63        2026         False
4  Mominul   25  EEE     80        2025          True
5  kawsary   26  GCE     90        2024         False

eikhan a j ekta faka () dwa hoi oita holo function bujanor jonno
attribute hole () drkar nai.
r ei fuction ta sob kisu min median mode sob eksathe analysis kore dibe

eikhan a se numeric value gulo dibe string dibena

In [19]:
display(a.describe())

             Age      Score   Grad. year
count   6.000000   6.000000     6.000000
mean   25.000000  77.666667  2025.000000
std     0.894427  12.209286     0.894427
min    24.000000  63.000000  2024.000000
25%    24.250000  67.250000  2024.250000
50%    25.000000  80.000000  2025.000000
75%    25.750000  87.500000  2025.750000
max    26.000000  90.000000  2026.000000

In [20]:
display(a.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          6 non-null      object
 1   Age           6 non-null      int64
 2   Dept          6 non-null      object
 3   Score         6 non-null      int64
 4   Grad. year    6 non-null      int64
 5   Schoolarship  6 non-null      bool
dtypes: bool(1), int64(3), object(2)
memory usage: 374.0+ bytes

None

In [21]:
print(a.shape)

(6, 6)

data management nan number missing value

In [22]:
student_data={"Name":["Sakib","Momin","kawsar","Sakiba","Mominul","kawsary"],
              "Age":[24,25,26,np.nan,25,26],
              "Dept":["URP","ME","CE","CSE",np.nan,"GCE"],
              "Score":[63,80,90,63,80,90],
             "Grad. year":[2026,2025,np.nan,2026,np.nan,2024],
             "Schoolarship":[False,True,False,False,True,False]}
a=pd.DataFrame(student_data)
display(a)

      Name   Age Dept  Score  Grad. year  Schoolarship
0    Sakib  24.0  URP     63      2026.0         False
1    Momin  25.0   ME     80      2025.0          True
2   kawsar  26.0   CE     90         NaN         False
3   Sakiba   NaN  CSE     63      2026.0         False
4  Mominul  25.0  NaN     80         NaN          True
5  kawsary  26.0  GCE     90      2024.0         False

In [26]:
print(a.isnull().sum())

Name            0
Age             1
Dept            1
Score           0
Grad. year      2
Schoolarship    0
dtype: int64

fillna. prottek colum er mean dara.

In [23]:
print(a.fillna(a.mean()))

      Name   Age Dept  Score  Grad. year  Schoolarship
0    Sakib  24.0  URP     63     2026.00         False
1    Momin  25.0   ME     80     2025.00          True
2   kawsar  26.0   CE     90     2025.25         False
3   Sakiba  25.2  CSE     63     2026.00         False
4  Mominul  25.0  NaN     80     2025.25          True
5  kawsary  26.0  GCE     90     2024.00         False

C:\Users\User\AppData\Local\Temp\ipykernel_7220\2138089913.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(a.fillna(a.mean()))

missing value gulo 0 dara replace koro

In [25]:
print(a.fillna(0))

      Name   Age Dept  Score  Grad. year  Schoolarship
0    Sakib  24.0  URP     63      2026.0         False
1    Momin  25.0   ME     80      2025.0          True
2   kawsar  26.0   CE     90         0.0         False
3   Sakiba   0.0  CSE     63      2026.0         False
4  Mominul  25.0    0     80         0.0          True
5  kawsary  26.0  GCE     90      2024.0         False

sudhu ekta ba duita colummn ber korbo

In [29]:
a_new=a["Age"]
a_new

0    24.0
1    25.0
2    26.0
3     NaN
4    25.0
5    26.0
Name: Age, dtype: float64

eikhan a list kore nite hobe duita colum chaile

In [31]:
a_new=a[["Age","Score"]]
a_new

    Age  Score
0  24.0     63
1  25.0     80
2  26.0     90
3   NaN     63
4  25.0     80
5  26.0     90

In [ ]:
a_new=a[["Age","a.Score"]]
a_new

ekhn a eita sudhu true na false eita show korbe

In [33]:
a["Score"]>70

1    True
2    True
4    True
5    True
Name: Score, dtype: bool

eita te puro column r row show korbe

In [47]:
a[a["Score"]>70]

TypeError: tuple indices must be integers or slices, not str

In [ ]:
eita thik korte hobe

In [44]:
a=a[[a["Score"]<75] & [a["Age"]<25]]

TypeError: tuple indices must be integers or slices, not str

In [46]:
a.loc[2,["Age","Score]]

SyntaxError: EOL while scanning string literal (1008643296.py, line 1)

In [48]:
a.iloc[2,["Age","Score]]

SyntaxError: EOL while scanning string literal (3363262405.py, line 1)

excel theke data gula k direct read kore a_1 variable er moddhhe rakhbo

In [50]:
a_2=a.drop("Age",axis=1)
display(a_2)

AttributeError: 'tuple' object has no attribute 'drop'

In [ ]:
a_1=pd.read_excell("")
a_1.to_excell()